# Duplicates & Removing Duplicates

## duplicated
is a method in Pandas that can be used to identify duplicate rows in a DataFrame. It returns a boolean Series indicating whether each row is a duplicate of a previous row.

In [1]:
import pandas as pd

In [2]:
data = {
    'Student_ID': [101, 102, 103, 101, 104, 102, 105, 103],
    'Name': ['Alice', 'Bob', 'Charlie', 'Alice', 'David', 'Bob', 'Eve', 'Charlie'],
    'Age': [20, 22, 21, 20, 23, 22, 24, 21]
}
df = pd.DataFrame(data)
df

   Student_ID     Name  Age
0         101    Alice   20
1         102      Bob   22
2         103  Charlie   21
3         101    Alice   20
4         104    David   23
5         102      Bob   22
6         105      Eve   24
7         103  Charlie   21

In [3]:
df.duplicated()

0    False
1    False
2    False
3     True
4    False
5     True
6    False
7     True
dtype: bool

## drop_duplicates
In Pandas, the drop_duplicates function is used to remove duplicate rows from a DataFrame

In [4]:
df.drop_duplicates()

   Student_ID     Name  Age
0         101    Alice   20
1         102      Bob   22
2         103  Charlie   21
4         104    David   23
6         105      Eve   24

In [5]:
df

   Student_ID     Name  Age
0         101    Alice   20
1         102      Bob   22
2         103  Charlie   21
3         101    Alice   20
4         104    David   23
5         102      Bob   22
6         105      Eve   24
7         103  Charlie   21